config/cf/Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭтапа</Name>
					<Comment>//0 - этап, 1 - подпроцесс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьКомментарий</Name>
					<Comment>0 - не запрашивать, 1 - необязательный, 2 - обязательный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРамкиКанбанДоски</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/СостоянияЭтаповПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подпроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ЭтапыПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные этапы процессов.
//
Процедура ЗаполнитьЭтапыПроцессовПриПервоначальномЗаполнении(Знач ИмяТемы = "") Экспорт
	
	// Описываем структуру
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ЦветФона");
	ТЗ.Колонки.Добавить("ЦветТекста");
	ТЗ.Колонки.Добавить("ЦветРамкиКанбанДоски");
	ТЗ.Колонки.Добавить("СостояниеЭтапа");
	ТЗ.Колонки.Добавить("Картинка");
	
	ВД = Справочники.ЭтапыПроцессов;
	
	// Заполняем реквизитами
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Новый,			НСтр("ru = 'Новый'"),
		Перечисления.СостоянияЭтаповПроцесса.Новый);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Выполнение,		НСтр("ru = 'Выполнение'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Выполнено,		НСтр("ru = 'Выполнено'"),
		Перечисления.СостоянияЭтаповПроцесса.Выполнен);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Обработка,		НСтр("ru = 'Обработка'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Отложено,		НСтр("ru = 'Отложено'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Отменено,		НСтр("ru = 'Отменено'"),
		Перечисления.СостоянияЭтаповПроцесса.Закрыт);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Рассмотрение,	НСтр("ru = 'Рассмотрение'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Регистрация,	НСтр("ru = 'Регистрация'"),
		Перечисления.СостоянияЭтаповПроцесса.Подготовка);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.НазначениеОтветственных, НСтр("ru = 'Назначение ответственных'"),
		Перечисления.СостоянияЭтаповПроцесса.Подготовка);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Проверка,		НСтр("ru = 'Проверка'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Разрешение,		НСтр("ru = 'Разрешение'"),
		Перечисления.СостоянияЭтаповПроцесса.Выполнен);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Отказано,		НСтр("ru = 'Отказано'"),
		Перечисления.СостоянияЭтаповПроцесса.Закрыт);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Согласование,	НСтр("ru = 'Согласование'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Ожидание,		НСтр("ru = 'Ожидание'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Пауза,			НСтр("ru = 'Пауза'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Завершено,		НСтр("ru = 'Завершено'"),
		Перечисления.СостоянияЭтаповПроцесса.Закрыт);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Возобновлено,	НСтр("ru = 'Возобновлено'"),
		Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Бэклог,			НСтр("ru = 'Бэклог'"),
		Перечисления.СостоянияЭтаповПроцесса.Бэклог);
		
	ДобавитьВТаблицуЗначений(ТЗ, ВД.Приостановлено,	НСтр("ru = 'Приостановлено'"),
		Перечисления.СостоянияЭтаповПроцесса.Приостановка);	
	
	// Записываем
	Для Каждого Строки Из ТЗ Цикл
		
		Объект 			= Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);		
		
		// Устанавливаем цвета.
		ЦветаТемы					= ПолучитьЦветаТемы(Строки.Объект, ИмяТемы);
		Если ЦветаТемы = Неопределено Тогда
			ЦветаТемы = Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ЦветаТемы, "ЦветФона, ЦветТекста, ЦветРамкиКанбанДоски"); 
		Если ЦветаТемы.Картинка = Неопределено Тогда
			Объект.Картинка = Неопределено;
		Иначе
			Объект.Картинка = Новый ХранилищеЗначения(ЦветаТемы.Картинка.Получить());
		КонецЕсли;
		
		Объект.Записать();
		
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в таблицу значений данные
//
// Параметры:
//   нет
//
Процедура ДобавитьВТаблицуЗначений(ТЗ, Знач ОбъектСсылка, Знач Наименование, Знач СостояниеЭтапа)
	
	НоваяСтрока 						= ТЗ.Добавить();
	НоваяСтрока.Объект					= ОбъектСсылка;
	НоваяСтрока.Наименование			= Наименование;	
	НоваяСтрока.СостояниеЭтапа			= СостояниеЭтапа;
	
КонецПроцедуры

Функция Цвета(Знач ЦветФона, Знач ЦветТекста, Знач ЦветРамкиКанбанДоски, Знач Картинка = Неопределено)
	
	Возврат Новый Структура("ЦветФона,ЦветТекста,ЦветРамкиКанбанДоски,Картинка", 
		РаботаСЦветомКлиентСервер.ЦветВHex(РаботаСЦветомКлиентСервер.АбсолютныйЦвет(ЦветФона)),
		РаботаСЦветомКлиентСервер.ЦветВHex(РаботаСЦветомКлиентСервер.АбсолютныйЦвет(ЦветТекста)),
		РаботаСЦветомКлиентСервер.ЦветВHex(РаботаСЦветомКлиентСервер.АбсолютныйЦвет(ЦветРамкиКанбанДоски)),
		?(Картинка = Неопределено, Неопределено, Новый ХранилищеЗначения(Картинка)));
	
КонецФункции

Функция ПолучитьЦветаТемы(Знач ОбъектСсылка, Знач ИмяТемы)
	
	ВД = Справочники.ЭтапыПроцессов;
	
	Если ПустаяСтрока(ИмяТемы) Тогда
		
		#Область СтандартныеЦвета
		
		Если ОбъектСсылка = ВД.Новый Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.ТемноБордовый, WebЦвета.ТемноБордовый, БиблиотекаКартинок.сстНовый);
		ИначеЕсли ОбъектСсылка = ВД.Выполнение Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный, БиблиотекаКартинок.сстВыполнение);
		ИначеЕсли ОбъектСсылка = ВД.Выполнено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.ТемноЗеленый, WebЦвета.ТемноЗеленый, БиблиотекаКартинок.сстГалочка);				
		ИначеЕсли ОбъектСсылка = ВД.Обработка Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный, БиблиотекаКартинок.сстКлючСиний);
		ИначеЕсли ОбъектСсылка = ВД.Отложено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серый, WebЦвета.Серый, БиблиотекаКартинок.сстПауза);
		ИначеЕсли ОбъектСсылка = ВД.Отменено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серебряный, WebЦвета.Серебряный, БиблиотекаКартинок.сстЗнакСтоп);
		ИначеЕсли ОбъектСсылка = ВД.Рассмотрение Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный, БиблиотекаКартинок.сстЧасы);
		ИначеЕсли ОбъектСсылка = ВД.Регистрация Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Синий, WebЦвета.Синий, БиблиотекаКартинок.сстРегистрация);
		ИначеЕсли ОбъектСсылка = ВД.НазначениеОтветственных Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Коричневый, WebЦвета.ТемноБордовый, БиблиотекаКартинок.сстПользователь);
		ИначеЕсли ОбъектСсылка = ВД.Проверка Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Ультрамарин,	WebЦвета.Ультрамарин, БиблиотекаКартинок.сстПроверка);
		ИначеЕсли ОбъектСсылка = ВД.Разрешение Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.ТемноЗеленый, WebЦвета.ТемноЗеленый, БиблиотекаКартинок.сстВсеХорошо);
		ИначеЕсли ОбъектСсылка = ВД.Отказано Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серый, WebЦвета.Серый, БиблиотекаКартинок.сстВсеПлохо);
		ИначеЕсли ОбъектСсылка = ВД.Согласование Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Синий, WebЦвета.Синий, БиблиотекаКартинок.сстЗамок);
		ИначеЕсли ОбъектСсылка = ВД.Ожидание Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(30, 144, 255), Новый Цвет(30, 144, 255), БиблиотекаКартинок.сстОжидание);
		ИначеЕсли ОбъектСсылка = ВД.Пауза Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серый, WebЦвета.Серый, БиблиотекаКартинок.сстПауза2);
		ИначеЕсли ОбъектСсылка = ВД.Завершено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.ТемноЗеленый, WebЦвета.ТемноЗеленый, БиблиотекаКартинок.сстЗавершено);
		ИначеЕсли ОбъектСсылка = ВД.Возобновлено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Красный,	WebЦвета.Красный, БиблиотекаКартинок.сстВнимание);
		ИначеЕсли ОбъектСсылка = ВД.Бэклог Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.СинеСерый, WebЦвета.Синий, БиблиотекаКартинок.сстСписок);				
		ИначеЕсли ОбъектСсылка = ВД.Приостановлено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серый, WebЦвета.Серый, БиблиотекаКартинок.сстПауза);
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ИмяТемы = "ПастельныеТона" Тогда
		
		#Область ПастельныеТона
		
		Если ОбъектСсылка = ВД.Новый Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(219, 53, 82), Новый Цвет(178, 79, 63), БиблиотекаКартинок.сстЗвезда2);
		ИначеЕсли ОбъектСсылка = ВД.Выполнение Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 159, 77), WebЦвета.Черный, БиблиотекаКартинок.сстГалочкаВКруге);
		ИначеЕсли ОбъектСсылка = ВД.Выполнено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный, БиблиотекаКартинок.сстФлаг2);				
		ИначеЕсли ОбъектСсылка = ВД.Обработка Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(123, 104, 238), Новый Цвет(123, 104, 238), БиблиотекаКартинок.сстШестеренка);
		ИначеЕсли ОбъектСсылка = ВД.Отложено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(82, 94, 97), Новый Цвет(117, 120, 123), БиблиотекаКартинок.сстОтказ3);
		ИначеЕсли ОбъектСсылка = ВД.Отменено Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Серебряный, WebЦвета.Серебряный, БиблиотекаКартинок.сстВнимание2);
		ИначеЕсли ОбъектСсылка = ВД.Рассмотрение Тогда
			Возврат Цвета(WebЦвета.Белый, WebЦвета.Черный, WebЦвета.Черный, БиблиотекаКартинок.сстЛупа);
		ИначеЕсли ОбъектСсылка = ВД.Регистрация Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 87, 184), Новый Цвет(0, 87, 184), БиблиотекаКартинок.сстБланк);
		ИначеЕсли ОбъектСсылка = ВД.НазначениеОтветственных Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(104, 91, 199), Новый Цвет(104, 91, 199), БиблиотекаКартинок.сстБирка2);
		ИначеЕсли ОбъектСсылка = ВД.Проверка Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 133, 173), Новый Цвет(0, 133, 173), БиблиотекаКартинок.сстСинийФлаг);
		ИначеЕсли ОбъектСсылка = ВД.Разрешение Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(52, 168, 83), Новый Цвет(52, 168, 83), БиблиотекаКартинок.сстЗамок2);
		ИначеЕсли ОбъектСсылка = ВД.Отказано Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(229, 0, 100), Новый Цвет(229, 0, 100), БиблиотекаКартинок.сстМинус);
		ИначеЕсли ОбъектСсылка = ВД.Согласование Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(64, 93, 230), Новый Цвет(64, 93, 230), БиблиотекаКартинок.сстПирамида);
		ИначеЕсли ОбъектСсылка = ВД.Ожидание Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(141, 108, 171), Новый Цвет(141, 108, 171), БиблиотекаКартинок.сстТаймер);
		ИначеЕсли ОбъектСсылка = ВД.Пауза Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(128, 128, 128), WebЦвета.Серый, БиблиотекаКартинок.сстПауза5);
		ИначеЕсли ОбъектСсылка = ВД.Завершено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 156, 166), Новый Цвет(0, 156, 166), БиблиотекаКартинок.сстГалкаВЩите);
		ИначеЕсли ОбъектСсылка = ВД.Возобновлено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(245, 130, 104), WebЦвета.Красный, БиблиотекаКартинок.сстМетка);
		ИначеЕсли ОбъектСсылка = ВД.Бэклог Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 164, 232), Новый Цвет(0, 164, 232), БиблиотекаКартинок.сстШкаф);
		ИначеЕсли ОбъектСсылка = ВД.Приостановлено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(59, 89, 152), WebЦвета.Серый, БиблиотекаКартинок.сстСтоп3);
		КонецЕсли;
		
		#КонецОбласти
		
	ИначеЕсли ИмяТемы = "СовременнаяТема" Тогда
		
		#Область СовременнаяТема
		
		Если ОбъектСсылка = ВД.Новый Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(53, 28, 21), Новый Цвет(53, 28, 21), БиблиотекаКартинок.сстФлаг);
		ИначеЕсли ОбъектСсылка = ВД.Выполнение Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(75, 46, 131), Новый Цвет (75, 46, 131), БиблиотекаКартинок.сстПлей);
		ИначеЕсли ОбъектСсылка = ВД.Выполнено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(74, 174, 32), Новый Цвет(74, 174, 32), БиблиотекаКартинок.сстЗеленыйФлаг);
		ИначеЕсли ОбъектСсылка = ВД.Обработка Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 130, 114), Новый Цвет(0, 130, 114), БиблиотекаКартинок.сстЦиферблат);
		ИначеЕсли ОбъектСсылка = ВД.Отложено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(210, 70, 99), Новый Цвет(210, 70, 99), БиблиотекаКартинок.сстОтложено);
		ИначеЕсли ОбъектСсылка = ВД.Отменено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(255, 0, 0),Новый Цвет(255, 0, 0), БиблиотекаКартинок.сстВосклицание);
		ИначеЕсли ОбъектСсылка = ВД.Рассмотрение Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(83, 75, 56), Новый Цвет(83, 75, 56), БиблиотекаКартинок.сстРесет);
		ИначеЕсли ОбъектСсылка = ВД.Регистрация Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(49, 139, 255), Новый Цвет(49, 139, 255),  БиблиотекаКартинок.сстРег);
		ИначеЕсли ОбъектСсылка = ВД.НазначениеОтветственных Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(255, 185, 0), Новый Цвет(255, 185, 0), БиблиотекаКартинок.сстБирка);
		ИначеЕсли ОбъектСсылка = ВД.Проверка Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 80, 130), Новый Цвет(0, 80, 130), БиблиотекаКартинок.сстПоиск);
		ИначеЕсли ОбъектСсылка = ВД.Разрешение Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(143, 93, 183), Новый Цвет(143, 93, 183), БиблиотекаКартинок.сстОтправка);
		ИначеЕсли ОбъектСсылка = ВД.Отказано Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(153, 0, 0), Новый Цвет(153, 0, 0), БиблиотекаКартинок.сстОтказ);
		ИначеЕсли ОбъектСсылка = ВД.Согласование Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(101, 133, 237), Новый Цвет(101, 133, 237), БиблиотекаКартинок.сстЛист);
		ИначеЕсли ОбъектСсылка = ВД.Ожидание Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(245, 120, 20), Новый Цвет(245, 120, 20), БиблиотекаКартинок.сстОжидание2);
		ИначеЕсли ОбъектСсылка = ВД.Пауза Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(79, 116, 142), Новый Цвет (79, 116, 142), БиблиотекаКартинок.сстПауза4);
		ИначеЕсли ОбъектСсылка = ВД.Завершено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(51, 72, 44), Новый Цвет(51, 72, 44), БиблиотекаКартинок.сстГотово);
		ИначеЕсли ОбъектСсылка = ВД.Возобновлено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(255, 51, 0), Новый Цвет(255, 51, 0), БиблиотекаКартинок.сстЦель);
		ИначеЕсли ОбъектСсылка = ВД.Бэклог Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 164, 232), Новый Цвет(0, 164, 232), БиблиотекаКартинок.сстВосемь);
		ИначеЕсли ОбъектСсылка = ВД.Приостановлено Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(46, 68, 83), Новый Цвет(46, 68, 83), БиблиотекаКартинок.сстСтоп);		
		КонецЕсли;		
		
		#КонецОбласти
		
	ИначеЕсли ИмяТемы = "ТемнаяТема" Тогда
		
		#Область ТемнаяТема
		
		Если ОбъектСсылка = ВД.Новый Тогда
			Возврат Цвета(WebЦвета.Белый, Новый Цвет(0, 121, 193), Новый Цвет(178, 79, 63));
		КонецЕсли;		
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
